        <section class="section" id="p5">
          <h2>ABOUT</h2>
          <h3>ニコニコ動画始めました！！</h3>
          <p>ニコニコ動画では今まで動画としてこのウェブサイトに貼ってあった動画や、</p>
          <p>新規での動画は、皆さんに紹介したいこと等をアップロードしていきたいです。</p>
          <p class="flashanime"><a aria-label="プシュー、SNSなどのリンク" href="https://www.nicovideo.jp/user/125051420" target="_blank">プシューわんこ/のニコニコ動画へジャンプ</a></p>
          <h3>ユーチューブ始めました！！</h3>
          <p>ユーチューブでは今まで動画としてこのウェブサイトに貼ってあった動画や、</p>
          <p>新規での動画は、皆さんに紹介したいこと等をアップロードしていきたいです。</p>
          <p class="flashanime"><a aria-label="プシュー、SNSなどのリンク" href="https://www.youtube.com/@PusyuuWanko" target="_blank">プシューわんこ/のユーチューブへジャンプ</a></p>
          <h3>ツイッター始めました！！</h3>
          <p>ツイッターではプシューサービスの最新情報などを発信していきたいです。</p>
          <p>とうとうツイッターやめました、一年間ありがとうございました。様々な人、年代の方々と様々な話をしましたが、どれも良い思い出です。合計35人のフォロワー、皆さんありがとう、私は嬉しかったです。</p>
          <p>と思いきやまた始めました今回からはプシューサービスの最新情報発信を目的としてやっていきます。</p>
          <p class="flashanime"><a aria-label="プシュー、SNSなどのリンク" href="https://www.twitter.com/PusyuuWanko" target="_blank">プシューわんこ/のツイッターへジャンプ</a></p>
          <h3>ティックトック始めました！！</h3>
          <p>プシューサービスの最新情報発信とぷしゅーとした（気が抜けたまたは自信のない）動画をアップを目的としてやっていきます。</p>
          <p class="flashanime"><a aria-label="プシュー、SNSなどのリンク" href="https://www.tiktok.com/@pusyuuwanko" target="_blank">プシューわんこ/のティックトックへジャンプ</a></p>
          <h3>プシューIPS/PusyuuIPS始めました！！</h3>
          <p>こちらサービスは感想を投稿して共有できるサービスです。信憑性や信頼性の低い内容を見て投稿して楽しむサービスです。</p>
          <p>※不適切な言動や、暴言発言はできるだけご遠慮ください。使用は、利用規約、プライバシーポリシーに同意し自己責任でよろしくお願いします。</p>
          <p>傷つきやすい方へ、私管理者も結構傷つきやすい体質で結構昔はボロボロになるなんてしょっちゅうでした。それをどうにかしようとした時に気が付いたことがあります。相手は変えられない、なので自分が変わる。意味を掲示板などでいうのであればひどい書き込みは相手の感想であってそれがすべてじゃないことを知ってください。そして、あなたを応援できる人は世界中にいるし世界中の人全員に嫌われることもありません、そして、全員に好かれることもできません。</p>
          <p class="flashanime"><a aria-label="プシュー、SNSなどのリンク" href="https://21emon.wjg.jp/bbs_of_php" target="_blank">プシューIPS/PusyuuIPSへジャンプ</a></p>
          <h3>ギットハブ始めました！！</h3>
          <p>プシューサービスのオープンソースなデータ共有を目的としてやっていきます。</p>
          <p class="flashanime"><a aria-label="プシュー、SNSなどのリンク" href="https://www.github.com/PusyuuWanko" target="_blank">プシューわんこ/のギットハブへジャンプ</a></p>
        </section>
