        <section class="section">
          <h2>プログラミング言語の習得方法</h2>
          <h3>目次</h3>
          <ol class="marukado_waku">
            <li><a href="#p1">ズバリどのような覚え方がいいの？</a></li>
            <li><a href="#p2">細かく理由や仕組みがしれないと気がすまないタイプのおすすめの教材</a></li>
            <li><a href="#p3">内容を細かすするとこんがらがって先に進めなくなるタイプのおすすめの教材</a></li>
          </ol>
          <article class="article" id="p1">
            <h3>ズバリどのような覚え方がいいの？</h3>
            <p>これに関してはこの方法が正解だというものは覚え方もやり方も人それぞれなので、ありません。けど傾向や方向性によって近い方法を探す方法はありますのでそれをお話したいと思います。</p>
            <h4>1. 細かく理由や仕組みがしれないと気がすまないタイプ</h4>
            <p>このタイプの場合はC言語から学ぶことがおすすめです、まずPCがどのようにしてその言語を処理しているかそれを知るだけでもモヤモヤが晴れて次のスッテプに進みやすくなり、更にC言語は他の言語の考え方のベースになっていたりするので他の言語を使いたい際にも簡単に理解ができるようになります。</p>
            <h4>2. 内容を細かすするとこんがらがって先に進めなくなるタイプ</h4>
            <p>このタイプは流れで例えばこの関数にはこの機能が入っていてこれを動かすとこのような結果が帰ってくる、こんな感じで流れとコードの文字列を覚えてしまう、そんな感じで動作とその文字を完全記憶する感じで覚えるのがおすすめです。おすすめの覚えやすい言語に関してなのですが私はこのタイプではないというのとそもそも動作とそのコードを仕組み関係なしで覚えるという形なのでたいていどのコードでもそれで覚えられてしまうためソートできませんでしたが強いて言うのであれば、いくつかの言語を試して自分が覚えやすいというもので進めればよいのではないかなと思いました。
            話がそれてしまいますが、最近はChatGPTなどのAI機能もだいぶ進化しているのでそのあたりに聞きながら学習するのもありです。私からのアドバイスは：自分が作りたいように勉強しそして楽しめと言うことぐらいしかありません（上記のように細々言ったのですが結論言うと好きでやらないと続きにくいです）。</p>
          </article>
          <article class="article" id="p2">
            <h3>細かく理由や仕組みがしれないと気がすまないタイプのおすすめの教材</h3>
            <p>ユーでミー講師がやってる無料動画やとほほのWWW入門がおすすめです、あのへんのポイントはなぜという部分を細かく現実と照らし合わせながら教えてくれるので理解しやすいです。</p>
            <ul>
              <li><a href="https://www.youtube.com/@youseful_toba" target="_blank">ユースフル鳥羽眞嘉</a></li>
              <li><a href="https://www.youtube.com/@user-hl9uv6cv7k" target="_blank">Shin Coding Tutorial</a></li>
              <li><a href="https://www.tohoho-web.com" target="_blank">とほほのWWW入門</a></li>
            </ul>
          </article>
          <article class="article" id="p3">
            <h3>内容を細かすするとこんがらがって先に進めなくなるタイプのおすすめの教材</h3>
            <p>キノコードやHowcangなどの内容を細かく説明して行わないタイプの動画やサイトもたくさんありそちらの教材を参考にしてみても良いかもしれません。</p>
            <ul>
              <li><a href="https://www.youtube.com/@kinocode" target="_blank">キノコード</a></li>
              <li><a href="https://www.youtube.com/@howcang" target="_blank">Hoecang</a></li>
              <li><a href="https://www.youtube.com/@KiyotoUniv" target="_blank">誰でもエンジニア</a></li>
            </ul>
          </article>
        </section>
