        <section class="section" id="p1">
          <h2>HOME</h2>
          <h3>🐸プシューポートフォリオへようこそ🐸</h3>
          <p>このページはプシューがPHPとHTMLとCSSを駆使しながら知識の定着促進と技術力を表現する場です。もし<a href="https://21emon.wjg.jp/Profile" target="_blank">プシューわんこ/</a>がウェブへの技術力がどれくらいあるかをひと目で見ることも可能です。なぜCやpythonやJAVAやkotlinなどもできるのにここでそれを言わなかったか、それはウェブでは表現しにくい技術だからです。なぜJavaScriptの項目を入れなかったか、それはJSなしでもJSクオリティで動かすことをメインに考えているからです。もし企業さんでこいつJSできるのか？と思われることでしょう、そのためJSをOFFにしても機能はするがもちろんJSをONにしたときにはスクリプトが機能するようにこのサイトは構築されています。</p>
          <h3>このページの豆知識</h3>
          <p>このページにはこだわりがありとあることをすることによりより一層便利に使いやすくすることができます。例えばこのページには背景を変更する機能がついています、ページ設定から変更可能ですしダイアログ表示なので邪魔になりません！！、他にもページのフッターにはアニメーションがついており近未来的な感覚でページを閲覧することができます、他にもJSを無効にしてもある程度整った状態でページの閲覧が可能な構成で開発されていたり、他のページにないものがここに詰まっています。</p>
          <h3>このポートフォリオ作った理由</h3>
          <p>PHPでどこまでできるのかなーと思ってやってみました、まぁとはいえ何度も変更してるのでその時のできたという面影はあまりないかもしれません、まぁでも自力で作ってるのは確かです。そそ、プログラミング言語もやらないとなれないよねー、まぁそれは学習全般に言えることですけどね〜、ちなみにHTMLは高校三年の３月後半（2021年）からやり始めました（CSSはその一ヶ月後ぐらいから）がほんと早いよね時がすぎるの〜、最近はJS系フレームワークを使用したプログラミングを行ってます、nodejsってPHPのようなサーバーサイド系が時代的に戻ってきた感じだなーと感じてたりします。そんなのどうでも良いけどサーバーサイド言語は、扱い的にロード時にはHTNLとして完成してるのでmetaタグなどに自動的に入れたいときには超便利ですよね〜。</p>
        </section>
