        <section class="section">
          <h2>ハンデキャップを持ってるからこそ強くなる必要性</h2>
          <h3>目次</h3>
          <ol class="marukado_waku">
            <li><a href="#p1">ハンデキャップを持つとそのことを免罪符にする人たち</a></li>
            <li><a href="#p2">弱みのカバー方法</a></li>
            <li><a href="#p3">最後に</a></li>
          </ol>
          <article class="article" id="p1">
            <h3>ハンデキャップを持つとそのことを免罪符にする人たち</h3>
            <p>ハンデキャップを生まれながら持ったとします、何かしらの挑戦を求められたときに”私、障害を持ってるのでできません。”のようにハンデキャップを免罪符にします、けどそれって障害を持っていることが問題なのでしょうか？、本当の問題はあなたが何をやりたい（欲望は何な）のかを知り、それを行うためにそのハンデキャップの溝を埋めて動くことではないのでしょうか？、例えばですが足がなく出てきた人は車椅子に乗り、そのハンデキャップを埋めます、それは移動ができないと不便だからです、このように何かしらの目的（欲望）を求めて自立し動くというのは必要だと私は思います（私からしてみればあなたがどうしようがどうでも良いのですが書かなきゃ記事の目的がそれてしまうのでｗ）。でもこれだけは言えます、他人に依存して自立せずに生きると、いずれ相手に搾取される（全員が全員そうではないがあくまでも原因）になります。だからこそ今回の本題ハンデキャップを持つからこそ強くなる必要性です。</p>
            <h4>なぜ搾取されるのか？</h4>
            <p>もし、あなたが何でも言い負かす人だったとして、あなたは腹ぺこだったとします、相手は気が弱いですが食べ物を持っていたとしたらあなたは生きるために言い負かす能力を使いませんか？、そのように人間も動物なので弱肉強食の世界がどうしても出てしまいます（Qどうすることもできないの？Aできません、なぜならばこうしたいと言う欲望はあなたにはありますよね？）、やはり、そのような場なのであれば以下にして自分の弱みというのをカバーして生きていくかなのです。</p>
          </article>
          <article class="article" id="p2">
            <h3>弱みのカバー方法</h3>
            <p>なぜ、弱いものが強くなるしかないと言ったかといいますと、相手を変えるのはとてもむずかしいという問題があるからです、例えば、あなたは現在うまく行っていて人生の楽しみの真っ最中にあなたに、邪魔なので今この場でﾀﾋってくださいと言ってﾀﾋるわけがないじゃないですか、だって目的（欲望）があるんだもん。このように大げさなたとえではありましたが、相手に変わってもらおうとしてもずっとは続かないし、そもそも相手は動こうともしないわけですよ。目的（欲望）のために、そのため弱いなら弱いなりにカバーする方法を備えておく必要があると言う訳です。本題の弱みのカバー方法なんですが、これって正直あなたがどのような弱みというのをどのようにカバーしたいかなどによって異なってしまうのですよ、私はあくまでもアドバイスしかできなくて、最終的な解決はあなたに委ねられていると言うのが結論です。</p>
          <article class="article" id="p3">
            <h3>最後に</h3>
            <p>結局何だったのていうのがあるかもしれませんが、相手を変えられないことがわかっても自分を変える方法のマニュアルは自分にしかわからないというのと、相手ができるのはアドバイスだけということです。個人的にこのような他人がどうこうする話をするのはあまり得意ではないのですよね、だって他人がすることなんてどうでも良いんだもん好きにすればってなってしまう（だからこそ私は女性に嫌われるんですけどね。）。</p>
          </article>
        </section>
